results/springboot-optimal/r6gd.xlarge/wrk4.log
===== Spring Boot Benchmark (wrk) =====
Instance Type: r6gd.xlarge
Spring Boot Host: springboot-server-r6gd-xlarge

--- Warm-up Phase (30s) ---
Warm-up complete

--- Main Page - 2 threads, 50 connections, 60s ---
Running 1m test @ http://springboot-server-r6gd-xlarge:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.72ms    0.87ms  38.38ms   90.93%
    Req/Sec    14.93k   815.58    17.21k    74.25%
  Latency Distribution
     50%    1.61ms
     75%    1.86ms
     90%    2.34ms
     99%    4.58ms
  1782343 requests in 1.00m, 238.29MB read
Requests/sec:  29705.09
Transfer/sec:      3.97MB

--- Main Page - 2 threads, 100 connections, 60s ---
Running 1m test @ http://springboot-server-r6gd-xlarge:8080/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.14ms    1.11ms  37.64ms   80.24%
    Req/Sec    16.04k     0.96k   18.82k    67.58%
  Latency Distribution
     50%    3.04ms
     75%    3.53ms
     90%    4.37ms
     99%    6.24ms
  1915902 requests in 1.00m, 256.15MB read
Requests/sec:  31887.85
Transfer/sec:      4.26MB

--- High Load - 2 threads, 200 connections, 30s ---
Running 30s test @ http://springboot-server-r6gd-xlarge:8080/
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.94ms    2.06ms  76.41ms   80.51%
    Req/Sec    17.02k     0.97k   19.13k    69.57%
  Latency Distribution
     50%    5.70ms
     75%    6.75ms
     90%    8.06ms
     99%   11.51ms
  1012316 requests in 30.07s, 135.34MB read
Requests/sec:  33670.21
Transfer/sec:      4.50MB

===== Spring Boot Benchmark Complete =====